export type DataArrayType = {
  question: string;
  option1: string;
  option2: string;
}

export const data: Array<DataArrayType> = [
  {
    question: "Раздражает ли вас грязная посуда в раковине?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравится ли вам постоянно включенный громкий звук?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли вы работаете по ночам?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Способны ли вы заботиться о чужом домашним питомце?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Экономите ли вы на бытовых нуждах, товарах для дома?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "ЗОЖ для вас важнее чем удовольствия?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Приемлемо ли для вас иногда обмениваться одеждой?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы считаете, что коммунальные услуги нужно оплачивать строго в определенные числа?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Комфортно ли вам есть чужую еду, отличающуюся от ваших пищевых привычек?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Соблюдаете ли вы диеты или нестандартные подходы к питанию?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам доставляет удовольствие общение в большой шумной компании?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравятся ли вам откровенные беседы по душам?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли приходится вам выступать на сцене?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы больше склонны к спокойствию и компромиссам, чем к шумному поведению и бунтарству?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам доставляют дискомфорт малознакомые люди в квартире?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вас можно назвать спокойным и сдержанным человеком?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли у вас бывают периоды бурной физической активности?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы легко решаете бытовые проблемы?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравится ли вам помогать другим?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы готовы жертвовать личным удобством ради достижения своих целей?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Способны ли вы ударить кошку?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравится ли вам черный юмор?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нормально ли взять без спроса чужую еду в случае сильного голода?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Были в вашей жизни поступки, за которые до сих пор стыдно?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Приемлемо ли сквернословие в повседневной жизни?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Приходилось ли вам говорить лишнее под воздействием алкоголя?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам нравится знакомить и объединять разных людей?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Можете ли вы заступиться за постороннего человека?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Есть ли у вас опыт общения с коллекторами?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Считаете ли вы, что дети должны уступать места взрослым в общественном транспорте?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Раздражают ли вас курящие в помещении?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "В случае необходимости вам легче проснуться за несколько часов до рассвета, чем не ложиться вообще?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Знакомо ли вам чувство безотчетного страха?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы аккуратный?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли у вас бывает бессонница?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Считают ли вас брезгливым?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Есть ли у вас непереносимость определенных продуктов?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам более комфортно просыпаться в прохладной, а не слишком теплой комнате?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы согласны, что открытые окна более способствуют пыли и сквознякам, а не свежему воздуху в комнате?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Можете ли вы пригласить в дом малознакомого человека?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы считаете, что гости могут ночевать у вас в любое время?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравится ли вам отмечать в квартире праздник до утра?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы считаете, что важнее сгладить конфликт, чем довести его до логического завершения?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы стараетесь неукоснительно соблюдать правила и договоренности?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Умеете ли вы успокоить и рассмешить плачущего ребенка?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Легко ли вы раздражаетесь?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Нравится ли вам угощать других?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли вы возвращаетесь домой посреди ночи?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "У вас высокая социальная активность и желание общаться?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Важно ли для вас иметь общие интересы с человеком, живущим в одной квартире?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Хотите ли вы расширить свой круг общения?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам нужен человек, способный помочь в бытовых проблемах?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Совместное проживание позволяет экономить – вы согласны?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Является ли эффективной совместная подготовка к экзаменам?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Чувствуете ли вы себя увереннее рядом с харизматичными людьми?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вас пугает рост преступности?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Часто ли вы теряете ключи?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Могут ли уживаться в одной комнате люди с противоположными взглядами на жизнь?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Легко ли вы даете в долг и делитесь продуктами?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы не можете уважать человека, способного бить животных?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Сова и жаворонок не уживутся в одной комнате - вы согласны?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вас может оскорбить неуместное чувство юмора?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Люди, не соблюдающие личную гигиену, вызывают у вас чувство брезгливости?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Будет ли дискомфортным совместное проживание людей разных этнических культур?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вы прекратите общение с человеком, нарушившим договор?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вам интересно общаться с людьми другого образовательно-культурного уровня?",
    option1: "Да",
    option2: "Нет",
  },
  {
    question: "Вас раздражают беспомощные люди, не умеющие справляться с простыми ситуациями?",
    option1: "Да",
    option2: "Нет",
  },
]