export const abbreviations: any = {
  first_aid: {
    "Y": "Оказываю первую помощь",
    "N": "Не оказываю первую помощь",
    "U": "",
  },
  occupation: {
    "ST": "Студент",
    "EM": "Работающий",
    "FR": "Фрилансер",
    "UN": "Без работы",
    "UK": null,
  },
  pets: {
    "Y": "Есть питомец",
    "N": "Нет питомца",
    "U": null,
  },
  purpose: {
    "LT": "Сдаю жильё",
    "LH": "Ищу жильё",
    "LR": "Ищу соседа",
    "JB": "Просто смотрю",
  },
  smoking: {
    "Y": "Курю",
    "N": "Не курю",
    "S": "Иногда",
    "U": "",
  },
  socialInteraction: {
    "Y": "Открыт к общению",
    "N": "Не общителен",
    "U": "",
  },
};